; domain
(define (domain logistics)
	(:requirements :typing)
(:types
	location vehicle package city - object
	airport - location
	truck airplane - vehicle
)
(:predicates
	(at ?obj - object ?loc - location)
	(in ?obj1 - package ?veh - vehicle)
	(in-city ?loc - location ?city - city)
)

(:action load-airplane
	:parameters (?airplane - airplane ?obj - package ?loc - airport)
	:precondition (and
		(at ?obj ?loc)
		(at ?airplane ?loc)
	)
	:effect (and
		(not (at ?obj ?loc))
		(in ?obj ?airplane)
	)
)


(:action unload-airplane
	:parameters (?airplane - airplane ?obj - package ?loc - airport)
	:precondition (and
		(in ?obj ?airplane)
		(at ?airplane ?loc)
	)
	:effect (and
		(not (in ?obj ?airplane))
		(at ?obj ?loc)
	)
)


(:action fly-airplane
	:parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
	:precondition 
		(at ?airplane ?loc-from)
	:effect (and
		(not (at ?airplane ?loc-from))
		(at ?airplane ?loc-to)
	)
)


(:action load-truck
	:parameters (?truck - truck ?obj - package ?loc - location)
	:precondition (and
		(at ?truck ?loc)
		(at ?obj ?loc)
	)
	:effect (and
		(not (at ?obj ?loc))
		(in ?obj ?truck)
	)
)


(:action unload-truck
	:parameters (?truck - truck ?obj - package ?loc - location)
	:precondition (and
		(at ?truck ?loc)
		(in ?obj ?truck)
	)
	:effect (and
		(not (in ?obj ?truck))
		(at ?obj ?loc)
	)
)


(:action drive-truck
	:parameters (?truck - truck ?loc-from - location ?loc-to - location ?city - city)
	:precondition (and
		(at ?truck ?loc-from)
		(in-city ?loc-from ?city)
		(in-city ?loc-to ?city)
	)
	:effect (and
		(not (at ?truck ?loc-from))
		(at ?truck ?loc-to)
	)
)

)

; problem
(define (problem logistics-4-0) (:domain logistics)
(:objects
	obj21 - package
	obj22 - package
	obj23 - package
	tru1 - truck
	cit1 - city
	cit2 - city
	tru2 - truck
	apn1 - airplane
	apt2 - airport
	apt1 - airport
	obj11 - package
	obj13 - package
	obj12 - package
	pos2 - location
	pos1 - location
)
(:init
	(at apn1 apt2)
	(at tru1 pos1)
	(at obj11 pos1)
	(at obj12 pos1)
	(at obj13 pos1)
	(at tru2 pos2)
	(at obj21 pos2)
	(at obj22 pos2)
	(at obj23 pos2)
	(in-city pos1 cit1)
	(in-city apt1 cit1)
	(in-city pos2 cit2)
	(in-city apt2 cit2)
)
(:goal
	(and
		(at obj11 apt1)
		(at obj23 pos1)
		(at obj13 apt1)
		(at obj21 pos1)
	)
)
)

; plan
1. (load-truck tru1 obj13 pos1)
   deleted: (at obj13 pos1)
   added: (in obj13 tru1)
   goals met: 0 of 4
2. (load-truck tru1 obj11 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 0 of 4
3. (drive-truck tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 0 of 4
4. (unload-truck tru1 obj13 apt1)
   deleted: (in obj13 tru1)
   added: (at obj13 apt1)
   goals met: 1 of 4
5. (unload-truck tru1 obj11 apt1)
   deleted: (in obj11 tru1)
   added: (at obj11 apt1)
   goals met: 2 of 4
6. (load-truck tru2 obj21 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 2 of 4
7. (load-truck tru2 obj23 pos2)
   deleted: (at obj23 pos2)
   added: (in obj23 tru2)
   goals met: 2 of 4
8. (drive-truck tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 2 of 4
9. (unload-truck tru2 obj21 apt2)
   deleted: (in obj21 tru2)
   added: (at obj21 apt2)
   goals met: 2 of 4
10. (unload-truck tru2 obj23 apt2)
   deleted: (in obj23 tru2)
   added: (at obj23 apt2)
   goals met: 2 of 4
11. (load-airplane apn1 obj21 apt2)
   deleted: (at obj21 apt2)
   added: (in obj21 apn1)
   goals met: 2 of 4
12. (load-airplane apn1 obj23 apt2)
   deleted: (at obj23 apt2)
   added: (in obj23 apn1)
   goals met: 2 of 4
13. (fly-airplane apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 2 of 4
14. (unload-airplane apn1 obj21 apt1)
   deleted: (in obj21 apn1)
   added: (at obj21 apt1)
   goals met: 2 of 4
15. (unload-airplane apn1 obj23 apt1)
   deleted: (in obj23 apn1)
   added: (at obj23 apt1)
   goals met: 2 of 4
16. (load-truck tru1 obj21 apt1)
   deleted: (at obj21 apt1)
   added: (in obj21 tru1)
   goals met: 2 of 4
17. (load-truck tru1 obj23 apt1)
   deleted: (at obj23 apt1)
   added: (in obj23 tru1)
   goals met: 2 of 4
18. (drive-truck tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 2 of 4
19. (unload-truck tru1 obj21 pos1)
   deleted: (in obj21 tru1)
   added: (at obj21 pos1)
   goals met: 3 of 4
20. (unload-truck tru1 obj23 pos1)
   deleted: (in obj23 tru1)
   added: (at obj23 pos1)
   goals met: 4 of 4
